In [1]:
import pandas as pd

In [2]:
data = [[1, 100, 2008, 10, 5000], [2, 100, 2009, 12, 5000], [7, 200, 2011, 15, 9000]]
sales = pd.DataFrame(data, columns=['sale_id', 'product_id', 'year', 'quantity', 'price']).astype({'sale_id':'Int64', 'product_id':'Int64', 'year':'Int64', 'quantity':'Int64', 'price':'Int64'})

In [3]:
sales

   sale_id  product_id  year  quantity  price
0        1         100  2008        10   5000
1        2         100  2009        12   5000
2        7         200  2011        15   9000

In [19]:
sales["first_year"] = sales.groupby("product_id")["year"].transform("min")

In [20]:
sales

   sale_id  product_id  year  quantity  price  first_year
0        1         100  2008        10   5000        2008
1        2         100  2009        12   5000        2008
2        7         200  2011        15   9000        2011

In [22]:
sales[sales["year"] == sales["first_year"]][["product_id", "year", "quantity", "price"]]

   product_id  year  quantity  price
0         100  2008        10   5000
2         200  2011        15   9000